In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1, 2, 3,4])
s2 = pd.Series([3,4, 5, 6])
#s3 = pd.Series([4, 5, 6], index=[3, 4, 5])

### Concat --union all

In [3]:
pd.concat([s1,s2])

0    1
1    2
2    3
3    4
0    3
1    4
2    5
3    6
dtype: int64

In [ ]:
בעצם יוצר משתנה חדש שמכיל בתוכו את כל הערכים כי הפקודה מאחדת את הכל לסדרה עם אינדקס

In [4]:
pd.concat([s1, s2], ignore_index=True)

0    1
1    2
2    3
3    4
4    3
5    4
6    5
7    6
dtype: int64

In [5]:
#axis=1 join them together by index
pd.concat([s1, s2],axis=1).rename(columns={0:"col1",1:"col2"})

   col1  col2
0     1     3
1     2     4
2     3     5
3     4     6

### concat() + drop_duplicates()--union

In [6]:
pd.concat([s1, s2], ignore_index=True).drop_duplicates()

0    1
1    2
2    3
3    4
6    5
7    6
dtype: int64

### isin  --intersect

In [7]:
s1[s1.isin(s2)]

2    3
3    4
dtype: int64

In [ ]:
רק הערכים שקיימים ב2 המערכים

### ~isin --except

In [8]:
s1[~s1.isin(s2)]

0    1
1    2
dtype: int64

In [ ]:
נשתמש בשלילה ובעצם נקבל את הערכים שלא קיימים ברשימה השניה

In [9]:
s2[~s2.isin(s1)]

2    5
3    6
dtype: int64

In [ ]:
a=s1[~s1.isin(s2)]
b=s2[~s2.isin(s1)]
pd.concat([a,b])

In [ ]:
לוקח את כל הערכים בייחודיים של כל רשימה ואז מאחדים לרשימה אחת

In [11]:
s1=pd.read_csv("data/Countries Population from 1995 to 2020.csv")

In [12]:
s2=pd.read_csv("data/Countries.csv")

In [13]:
s1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4195 entries, 0 to 4194
Data columns (total 14 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Year                            4195 non-null   int64
 1   Country                         4195 non-null   object
 2   Population                      4195 non-null   int64
 3   Yearly % Change                 4195 non-null   float64
 4   Yearly Change                   4195 non-null   int64
 5   Migrants (net)                  3600 non-null   float64
 6   Median Age                      3600 non-null   float64
 7   Fertility Rate                  3600 non-null   float64
 8   Density (P/Km²)                 4195 non-null   object
 9   Urban Pop %                     4082 non-null   float64
 10  Urban Population                4082 non-null   float64
 11  Country's Share of World Pop %  4195 non-null   float64
 12  World Population                4195 non-null   int64
 13  Country Global Rank             4195 non-null   int64
dtypes: float64(7), int64(5), object(2)
memory usage: 459.0+ KB

In [14]:
s2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4195 entries, 0 to 4194
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   year              4195 non-null   int64
 1   country           4195 non-null   object
 2   population        4195 non-null   int64
 3   world_population  4195 non-null   int64
dtypes: int64(3), object(1)
memory usage: 131.2+ KB

In [ ]:
התנאי בכדי לאחד בין 2 מסדים הוא שהשדה יהיה קרוי אותו הדבר ולכן נתקן את השמות של השדות המקשרים

In [15]:
a=s1[["Year","Country"]].rename(columns={"Year":"year","Country":"country"})
b=s2[["year","country"]]
pd.concat([a,b])

      year   country
0     2020     China
1     2019     China
2     2018     China
3     2017     China
4     2016     China
...    ...       ...
4190  1975  Holy See
4191  1970  Holy See
4192  1965  Holy See
4193  1960  Holy See
4194  1955  Holy See

[8390 rows x 2 columns]

In [ ]:
pd.concat([a,b],ignore_index=0)

In [16]:
pd.concat([a,b],ignore_index=0).drop_duplicates()

      year   country
0     2020     China
1     2019     China
2     2018     China
3     2017     China
4     2016     China
...    ...       ...
4190  1975  Holy See
4191  1970  Holy See
4192  1965  Holy See
4193  1960  Holy See
4194  1955  Holy See

[4195 rows x 2 columns]

In [ ]:
התעלמנו מהאינדקס ויצרנו אינדקס חדש לפי כמות הערכים

In [17]:
odd_numbers = [(1),(2),(3),(5),(7),(9),(11)]
odd_numbers_s = pd.Series(odd_numbers)
odd_numbers_df = odd_numbers_s.to_frame("Id")

In [18]:
even_numbers = [(1),(2),(4),(6),(8),(10),(12)]
even_numbers_s = pd.Series(even_numbers)
even_numbers_df = even_numbers_s.to_frame("Id")

In [19]:
odd_numbers_df

   Id
0   1
1   2
2   3
3   5
4   7
5   9
6  11

In [20]:
even_numbers_df

   Id
0   1
1   2
2   4
3   6
4   8
5  10
6  12

In [21]:
import numpy as np

In [22]:
even_numbers_df["new"] = np.random.random( )

In [23]:
even_numbers_df

   Id       new
0   1  0.867611
1   2  0.867611
2   4  0.867611
3   6  0.867611
4   8  0.867611
5  10  0.867611
6  12  0.867611

In [24]:
pd.concat([even_numbers_df, odd_numbers_df])

   Id       new
0   1  0.867611
1   2  0.867611
2   4  0.867611
3   6  0.867611
4   8  0.867611
5  10  0.867611
6  12  0.867611
0   1       NaN
1   2       NaN
2   3       NaN
3   5       NaN
4   7       NaN
5   9       NaN
6  11       NaN

In [ ]:
pd.concat([even_numbers_df, odd_numbers_df], ignore_index = True)

In [ ]:
even_numbers_df.append(odd_numbers_df, ignore_index = True)

In [25]:
pd.concat([even_numbers_df, odd_numbers_df], ignore_index = True).drop_duplicates()

    Id       new
0    1  0.867611
1    2  0.867611
2    4  0.867611
3    6  0.867611
4    8  0.867611
5   10  0.867611
6   12  0.867611
7    1       NaN
8    2       NaN
9    3       NaN
10   5       NaN
11   7       NaN
12   9       NaN
13  11       NaN

In [26]:
pd.concat([even_numbers_df, odd_numbers_df], ignore_index = True).drop_duplicates()\
.sort_values(["Id"], ascending = [True])

    Id       new
0    1  0.867611
7    1       NaN
1    2  0.867611
8    2       NaN
9    3       NaN
2    4  0.867611
10   5       NaN
3    6  0.867611
11   7       NaN
4    8  0.867611
12   9       NaN
5   10  0.867611
13  11       NaN
6   12  0.867611

In [27]:
pd.merge(even_numbers_df, odd_numbers_df)

   Id       new
0   1  0.867611
1   2  0.867611

In [ ]:
mask = ~even_numbers_df["Id"].isin(odd_numbers_df["Id"])
even_numbers_df[mask]

In [ ]:
mask = ~odd_numbers_df["Id"].isin(even_numbers_df["Id"])
odd_numbers_df[mask]